app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Fede"], ["body", "Este post es una mierda"], ["created_at", "2014-06-30 03:26:28.570509"], ["post_id", 1], ["updated_at", "2014-06-30 03:26:28.570509"]]