app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "HolaHolaHola"], ["created_at", "2014-06-23 13:42:29.637035"], ["title", "HolaHola"], ["updated_at", "2014-06-23 13:42:29.637035"]]

  def update
    @post = Post.find params[:id]

    if @post.update post_params
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["body", "nuevo body2"], ["updated_at", "2014-06-23 23:22:03.616410"]]

  def destroy
    @post = Post.find params[:id]
    @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]