app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    #binding.pry
    @user = User.new(params[:user])
    if @user.save